---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallTaperedUseInstanceAngles
source: html/abdba070-0765-12b4-e2d1-104f17262da9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallTaperedUseInstanceAngles Property

"Enable Angle Overrides"

## Syntax (C#)
```csharp
public static ForgeTypeId WallTaperedUseInstanceAngles { get; }
```